#include <iostream>
using namespace std;

int main() {
	int a, b, n;
	cin >> a >> b;
	cin >> n;

	// хамгийн ихдээ 4 нүүгээд үхлийн тэгш өнцөгтөд орж ирнэ
	// үхлийн тэгш өнцөгтөд орж иртэл, эсвэл нүүдэл дуустал нүүе
	if (n > 0 && (a > 3 || b > 3)) {
		if (b > 3) {
			b = b - 3; // зүүн тийш
			n = n - 1;
		} else {
			a = a - 3;
			n = n - 1;
		}
	}

	if (n > 0 && (a > 3 || b > 3)) {
		if (b > 3) {
			b = b - 3; // зүүн тийш
			n = n - 1;
		} else {
			a = a - 3;
			n = n - 1;
		}
	}

	if (n > 0 && (a > 3 || b > 3)) {
		if (b > 3) {
			b = b - 3; // зүүн тийш
			n = n - 1;
		} else {
			a = a - 3;
			n = n - 1;
		}
	}

	if (n > 0 && (a > 3 || b > 3)) {
		if (b > 3) {
			b = b - 3; // зүүн тийш
			n = n - 1;
		} else {
			a = a - 3;
			n = n - 1;
		}
	}
	// үүнээс цааш баруун зүүн баруун зүүн гэх мэт давтагдана
	// тэгш бол байрандаа
	if (n % 2 == 0) {
		cout << a << " " << b;
	} else { // үгүй бол баруун нүүсэн байрандаа очно
		cout << a << " " << b + 3;
	}
	return 0;
}