#include <iostream>


// Стандарт орчиг тохируулаарай
int main() {
    // Бүхэл тоо хадгалах боломжтой a, b, c хувьсагчдыг зарлаарай
    // Бүхэл тоо хадгалах боломжтой x, y, z хувьсагчдыг зарлаарай
    // a, b, c хувьсагчдад стандарт оролтоос утга аваарай
    // x хувьсагчид a болон b хувьсагчдыг нийлбэрийг хадгалаарай
    // y хувьсагчид b болон c хувьсагчийн үржвэрийг хадгалаарай
    // z хувьсагчид c болон a хувьсагчийн ялгаварыг хадгалаарай
    // x болон у хувьсагчийн нийлбэрийг хэвлээд дараа нь мөр шилжээрэй
    // y болон z хувьсагчийн үржвэрийг хэвлээд дараа нь мөр шилжээрэй
    // z болон x хувьсагчийн ялгаварыг хэвлээрэй
    return 0;
}